{
    "format": "layers-model",
    "generatedBy": "keras v2.3.0-tf",
    "convertedBy": "TensorFlow.js Converter v2.0.0",
    "modelTopology": {
        "keras_version": "2.3.0-tf",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Model",
            "config": {
                "name": "SimpleMNISTModel",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                28,
                                28,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_7"
                        },
                        "name": "input_7",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv_layer1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": 0
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv_layer1",
                        "inbound_nodes": [
                            [
                                [
                                    "input_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pool_layer1",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pool_layer1",
                        "inbound_nodes": [
                            [
                                [
                                    "conv_layer1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv_layer2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": 0
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv_layer2",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pool_layer1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pool_layer2",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pool_layer2",
                        "inbound_nodes": [
                            [
                                [
                                    "conv_layer2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_layer1",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.2,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout_layer1",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pool_layer2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten_layer",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        },
                        "name": "flatten_layer",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout_layer1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "fc_layer1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 2048,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": 0
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "fc_layer1",
                        "inbound_nodes": [
                            [
                                [
                                    "flatten_layer",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "fc_layer2",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1024,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": 0
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "fc_layer2",
                        "inbound_nodes": [
                            [
                                [
                                    "fc_layer1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_layer2",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.2,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout_layer2",
                        "inbound_nodes": [
                            [
                                [
                                    "fc_layer2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "output_layer",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 10,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": 0
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "output_layer",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout_layer2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_7",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "output_layer",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": [
                "accuracy"
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "sample_weight_mode": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of7.bin",
                "group1-shard2of7.bin",
                "group1-shard3of7.bin",
                "group1-shard4of7.bin",
                "group1-shard5of7.bin",
                "group1-shard6of7.bin",
                "group1-shard7of7.bin"
            ],
            "weights": [
                {
                    "name": "conv_layer1/kernel",
                    "shape": [
                        5,
                        5,
                        1,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv_layer1/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv_layer2/kernel",
                    "shape": [
                        5,
                        5,
                        64,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv_layer2/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "fc_layer1/kernel",
                    "shape": [
                        2048,
                        2048
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "fc_layer1/bias",
                    "shape": [
                        2048
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "fc_layer2/kernel",
                    "shape": [
                        2048,
                        1024
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "fc_layer2/bias",
                    "shape": [
                        1024
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "output_layer/kernel",
                    "shape": [
                        1024,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "output_layer/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}